Revit 2025 API
ViewDiscipline Enumeration
 Discipline of the view
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ViewDiscipline
Public Enumeration ViewDiscipline
public enum class ViewDiscipline
type ViewDiscipline
Members
Member name | Value | Description
Architectural | 1 |  Architectural
Structural | 2 |  Structural
Mechanical | 4 |  Mechanical
Electrical | 8 |  Electrical
Plumbing | 16 |  Plumbing
Coordination | 4,095 |  Coordination
See Also
Reference
Autodesk.Revit.DB Namespace